fdr/src/test/resources/requests/nodoChiediTemplateInformativaPSP.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ppt="http://ws.pagamenti.telematici.gov/ppthead" xmlns:ws="http://ws.pagamenti.telematici.gov/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:nodoChiediTemplateInformativaPSP>
            <identificativoPSP>{psp}</identificativoPSP>
            <identificativoIntermediarioPSP>{brokerPsp}</identificativoIntermediarioPSP>
            <identificativoCanale>{channel}</identificativoCanale>
            <password>{channelPwd}</password>
        </ws:nodoChiediTemplateInformativaPSP>
    </soapenv:Body>
</soapenv:Envelope>