fdr/src/test/resources/requests/nodoChiediInformativaPA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pagamenti.telematici.gov/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:nodoChiediInformativaPA>
            <identificativoPSP>{psp}</identificativoPSP>
            <identificativoIntermediarioPSP>{brokerPsp}</identificativoIntermediarioPSP>
            <identificativoCanale>{channel}</identificativoCanale>
            <password>{channelPwd}</password>
            <identificativoDominio>{pa}</identificativoDominio>
        </ws:nodoChiediInformativaPA>
    </soapenv:Body>
</soapenv:Envelope>